""" Динамический массив - список в Питоне
Отличие от статического в том, что мы заранее не задаем его размер.
Можем добавить-удалить на лету

Статический - по 4 байта на каждый элемент по порядку
Обновление С - создание нового, и перезатирание старого с копированием
элементов в новый
Увеличение размера на 1 каждый раз это 1+2+3+...N = N * N/2 операций
Аналогично если на 100, то асимптотика в 100 раз меньше, но все еще
квадратичная """


""" Амортизационная сложность - усредненная сложность 
Из математики, если мы складываем степени двоек, то их сумма равна N/2
1+2+..16+N/2+1+1..+1 = (N-1) + N = 2N-1
Таким образом, асимптотика добавления 1 элемента О(1)
                           добавления N элементов О(N)-линейная зависимость
                           
В динамическом массиве вставка в конец одного элемента О(1), в начало О(N),
в середину О(N/2)
Обращение - О(1)"""