""" Есть N полосок, они лежат на одной прямой
Выбрать максимальное количество полосок, чтобы они не пересекались между собой
Начало и конец лежат в двух списках

N=4
l={1,1,3,2}
r={5,2,4,3}

Неправильно:
1. сортировка по началу отрезка
2. по длине полоски

Правильно: сортировка по концу отрезка.
А выбирать будем по тому, чтобы левая границы проверяемого была не меньше
правой границы последнего. Если проходит, инкремент счетчика
и смещение правой границы

Доказательство индуктивное (типа рекурсии)
"""