""" Алгоритм оптимального префиксного кодирования алфавита

Как мы можем хранить данные текстовые?
Например, через двоичный код. Но здесь возникает неоднозначность, потому что
один элемент выглядит как обозначение двух других, более коротких, что имелось
ввиду?

Алгоритм Хаффмана позволяет получить кодировку, оптимальную по длине.
Не короче исходника, но не бессмысленно удлиненный
На нем базируются алгоритмы сжатия

Сначала считаем,сколько раз буква встретилась в коде, потом кодируем.
Если б из 20 букв 10 были бы А, то она получила бы код 0, и остальные уже 1,2..

Каждая буква имеет 2 вершины: обозначение и количество повторов
Начинаем соединять вершины попарно, от минимальных. Ветки имеют 1 и 0 - выбор
какая из букв, а встречаемость суммируется

"""