""" Смысл в том, чтобы разбить большой массив на два, например, мелких
и отсортировать их. Это довольно быстро. Потом поочередно брать начальные
элементы массивов и собирать их в один общий список по старшинству,
сначала младшие
Начальные элементы не удаляем, не смещаем, только переставляем указатель """


""" Для рекурсии нужен крайний случай - когда деление массивов пополам
доведет каждый из них до 1 элемента """


""" Время и память 
Глубина рекурсии - логарифмическая, потому что делим на 2 и делим, и делим 
"""