""" Размен памяти на скорость - перемена местами двух переменных
при помощи третьей. Скорость выше, памяти взяли больше """

""" Размен памяти на время (дольше, но памяти лишней не используется)
Перемена местами при помощи вычитания 
Без доп. памяти, но больше операций """

a = 8
b = 10
a = a + b    # 8+10
b = a - b    # 8+10-10
a = a - b    # 8+10-8
print(a, b)  # --> 10 8


""" Перемена местами за счет XOR 

a = a ^ b
b = b ^ a 
a = a ^ b 

За счет того, что a^a=0 и следовательно a ^ b ^ b = a """


