""" Самый долгий. Берем несортированный массив и пустой подмассив.
Начинаем вынимать из несортированного по элементу и передавать его в новый.
Сначала находим место для вставки текущего элемента (чтобы не утерять
сортировку), потом сдвигаем массив и вставляем на свободное место элемент.
Так новый массив получается сразу сортированным

Аналогичное можно сделать на месте, используя как подмассив левую,
сортированную часть массива

Асимптотика - О(N**2) в худшем,  лучшем O(N)

Стабильность сортировки - сохранение порядка при использовании дополнительной
сортировки (устойчивость):
- выбором - не стабильна
- вставками - стабильна
- """