""" Самая быстрая

За одно сравнение мы получаем 1 бит информации, и поэтому нельзя сделать
сортировку быстрее, чем O(N) """

import math

# def sorter(a, b):
#
#     d = (a + b) / 2 + abs(a - b) / 2
#     c = a+b-d
#     return c, d
#
#
# q = 10
# w = 12
# print(sorter(q, w))

""" Дан массив чисел от 1 до n, записанных в случайном порядке. 
Необходимо отсортировать его за линейное время 

Суммарно от O(N)
Почему быстрее, чем от логарифма? Потому что есть строгое ограничение
на количество элементов 

Но если элементов 10, а не 1000, то пузырек сработает быстрее """

a = [1, 7, 1, 8, 4, 7, 6, 7, 8, 2, 5, 5]
b = len(a) * [0]

for i in a:
    b[i] += 1

print(b)

k = 0
for i in range(len(a)):
    for j in range(b[i]):
        a[k] = i
        k += 1

print(a)

