""" Медиана - такое число, что половина элементов массива больше него,
половина меньше. Это не среднее арифметическое

Чтобы избежать использования дополнителного массива, можно найти медианное
значение, по нему разделить массив на две части (левую и правую), каждую из
них отдельно отсортировать

Пока пропустим кусок поиска медианы, сразу возьмем массив, в котором мы знаем
медиану, например [5,4,1,5,4,3,3] и пойдем двумя индексами слева направо и
справа налево и будем перемещать вправо то, что больше медианы и влево то,
что меньше. Когда они пересекутся - все в своих половинах """


""" Не обязательно брать именно медиану, можно взять любое число и 
относительно него разделить на две части

Алгоритм работает рекурсивно

Быстрее сортировки слиянием потому что:
 - не нужны дополнительные массивы, 
 - лучше локальность данных,
 - лучше попадает в кеш
 
В худшем случае может работать за квадратичную асимптотику, может слишком
глубоко войти в рекурсию.
Чтобы этого избежать перепишем так, чтобы в более мелкой части шел рекурсивно, 
а в большей продолжал сортировать

Можно переписать алгоритм и делить на три части: строго меньше, строго больше
и равно выбранному числу (медиане)
"""

""" 
Так как мы делим по медианному элементу, асимптоика логарифмическая
А если бы мы делили на 1/4 и 3/4?
На каждом слое у нас выполнялось бы не больше, чем O(N) операций
Тоже будет логарифмическая, но по основании 4/3 """

